[{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-35a6c9ee-478d-3bec-95dc-629e3ec1498a_a-901083eb-c6e4-3c92-8bc1-aa7ee84b76a4","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/las-vegas-shooting-veteran-stole-1myoadp","author":"ipostwhaticareabout","provider":"The Telegraph","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/las-vegas-shooting-veteran-stole-141816718.html","img":"http:\/\/media.zenfs.com\/en-GB\/homerun\/the_telegraph_258\/755135ae07cb30f277e0fe5969480533","title":"Las Vegas shooting: Veteran who stole pickup truck to help victims gets reward","summary":"A US Marine veteran who stole a pickup truck to rush victims of the Las Vegas shooting to hospital is set to receive a small reward for his bravery from a car dealership. Taylor Winston risked his life to stay behind and help those injured as bullets rained down from the 32nd floor of the Mandalay Bay Hotel in the deadliest mass shooting in modern US history. He commandeered a truck which he found with the keys still in the ignition at the Route 91 Harvest country music festival to bring victims to a nearby medical centre.   The 29-year-old is now set to receive his own free pickup truck after B5Motors, a dealership based in Arizona, tracked him down. Mr Winston, who was honourably discharged after serving in the military from 2006 to 2011, plans to sell his current vehicle and donate the money to victims of the Vegas shooting. “At B5Motors we have been overwhelmed with the heartbreaking stories coming out of Vegas,” the dealership posted on Facebook. “He stole a truck to quickly transport the injured to the hospital. We would like to find Taylor and thank him for his bravery by providing him a free truck from B5Motors. “We are honored to play a role in this full-circle story as now Taylor will be selling his current vehicle and donating those funds to the Vegas victims. “Thank you all for helping us find Taylor, we could not have done it without the efforts of our B5 Motors friends on social media.” 50 dead in Las Vegas shooting, in pictures During the shooting, another group of friends set up an emergency triage area to treat those with injuries at the scene. Meanwhile,  police have recalled the moment they stormed gunman Stephen Paddock's hotel suite. ","published_at":1507555390,"content_id":"901083eb-c6e4-3c92-8bc1-aa7ee84b76a4","content_url":"https:\/\/www.yahoo.com\/news\/las-vegas-shooting-veteran-stole-141816718.html","content_published_at":1507558696,"content_relative_time":7,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-dd6d8a73-afe1-3d76-a0b4-8978b14d640f_a-976e677c-e2ae-3b87-b996-88452dd3fd9f","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/dove-faces-pr-disaster-over-5ny3fse","author":"nanook","provider":"Reuters","lead_attribution":"provider","link":"https:\/\/finance.yahoo.com\/news\/dove-faces-pr-disaster-over-112028352.html","img":"http:\/\/globalfinance.zenfs.com\/images\/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW\/2017-10-09T115241Z_3_LYNXMPED980OG_RTROPTP_3_UNILEVER-ADVERTISING_original.jpg","title":"Dove faces PR disaster over ad that showed black woman turning white","summary":"A social media outcry over an advertisement for Dove body wash which showed a black woman removing her top to reveal a white woman has escalated into a public relations disaster for the Unilever brand. The 3-second video clip, posted on Dove's U.S. Facebook page on Friday, reminded some social media users of racist soap adverts from the 19th century or early 20th century that showed black people scrubbing their skin to become white. Dove removed the clip and apologized, saying on Twitter that the post had \"missed the mark in representing women of color thoughtfully\".","published_at":1507536654,"content_id":"976e677c-e2ae-3b87-b996-88452dd3fd9f","content_url":"https:\/\/finance.yahoo.com\/news\/dove-faces-pr-disaster-over-112028352.html","content_published_at":1507549961,"content_relative_time":10,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-511fde00-6451-3a83-8bf8-43dfb3129f22_a-99e096e0-6bd0-3300-a3d9-21dd36da599b","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/chelsea-manning-finds-sympathetic-crowd-ny-appearance-6a2muo5","author":"third_watch","provider":"Associated Press","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/chelsea-manning-finds-sympathetic-crowd-ny-appearance-054645333.html","img":"http:\/\/media.zenfs.com\/en_us\/News\/ap_webfeeds\/fd5fe879dc73431ca5b039281b5a7710.jpg","title":"Chelsea Manning finds a sympathetic crowd in NY appearance","summary":"NEW YORK (AP) — She may have been disinvited by Harvard and turned away from Canada, but Chelsea Manning earned applause, laughter and even some tears of empathy from a friendly crowd at the annual New Yorker Festival.","published_at":1507528145,"content_id":"99e096e0-6bd0-3300-a3d9-21dd36da599b","content_url":"https:\/\/www.yahoo.com\/news\/chelsea-manning-finds-sympathetic-crowd-ny-appearance-054645333.html","content_published_at":1507581520,"content_relative_time":1,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1d3403d0-e689-3e2e-9f5e-e4cf17deceb7_a-0e2a081b-e66f-3b06-8f10-4fbbdf6760ea","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1d3403d0-e689-3e2e-9f5e-e4cf17deceb7_a-0e2a081b-e66f-3b06-8f10-4fbbdf6760ea","author":"ipostwhaticareabout","provider":"Mashable","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/trump-feeling-really-really-under-020639524.html","img":"http:\/\/media.zenfs.com\/en-US\/homerun\/news.mashable\/57f737af3ef12fb0f056f6622c204b0d","title":"Trump is feeling really, really under-appreciated for his Puerto Rico efforts, you guys","summary":"Trump's latest tweet about Puerto Rico is certainly on-brand, to say the least. The U.S. president uploaded a supercut video of the relief efforts in Puerto Rico following Hurricane Maria, a 1984-esque piece of propaganda that's more about receiving the credit for helping, rather than well, actually helping. SEE ALSO: FEMA omits statistics on Puerto Rico hurricane response from website Titled \"What the fake news media will not show you in Puerto Rico,\" the eight-minute video consists of a mishmash of footage from various agencies, ending with Trump shaking people's hands in the four hours that he was there. \"Nobody could have done what I've done for #PuertoRico with so little appreciation. So much work!\" Trump tweeted.  Of course, the video comes following criticism of the Trump administration's handling of the disaster — and handling of paper towels. Namely, criticism comes from San Juan Mayor Carmen Yulín Cruz, whose complaints were rebuffed as \"political noise\" by FEMA administrator Brock Long. Power collapses in San Juan hospital with 4 patients now being transferred out. Have requested support from FEMA. NOTHING! @DavidBegnaud — Carmen Yulín Cruz (@CarmenYulinCruz) October 8, 2017 The death toll following the Category 4 storm on Sept. 20 stands at 36, but is expected to rise as hospitals still struggle almost three weeks after the disaster hit. The island is still largely without basic utilities: Approximately 56.8 percent of its people have drinking water, and a tiny 11.7 percent of people have electricity.  But don't worry about all that. Worry about Trump not getting the plaudits that he's so very used to, because that's what he'd want you to do. The biggest tragedy about #PuertoRico is, first and foremost, the lack of appreciation for you. https:\/\/t.co\/EC3XXQ1vO2 — Patton Oswalt (@pattonoswalt) October 9, 2017 Remarkable narcissism. There's really no more debate. Ego before country, enabled by a faithful base. https:\/\/t.co\/NQDF56glKT — David Jolly (@DavidJollyFL) October 9, 2017 Thanks for doing your job Mr. President. Next time, try using the word \"we\" to describe these efforts and future ones. https:\/\/t.co\/wRurJCvmnu — Michael McFaul (@McFaul) October 9, 2017 WATCH: Los Angeles is painting their roads white to cool the city down and improve air quality","published_at":1507524634,"content_id":"0e2a081b-e66f-3b06-8f10-4fbbdf6760ea","content_url":"https:\/\/www.yahoo.com\/news\/trump-feeling-really-really-under-020639524.html","content_published_at":1507514799,"content_relative_time":19,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-17bd392d-ddf9-3485-be6c-2d20bd4d0036_a-4e8c0637-b84b-395d-b695-f6cbda9c62a1","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/one-mass-shooting-every-day-7wj5f2l","author":"nanook","provider":"The Telegraph","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/one-mass-shooting-every-day-112203494.html","img":"http:\/\/media.zenfs.com\/en-GB\/homerun\/the_telegraph_258\/d5524befeaa12fae8b3b4c6bf39f7e26","title":"One mass shooting every day: Seven facts about gun violence in America","summary":"Stephen Paddock's gun attack at a Las Vegas country music festival has left at least 59 people dead. It was the deadliest mass shooting in modern US history, once again highlighting America's extreme rate of gun violence. The frequency of this kind of event risks anaesthetising us to the number of people who die from shootings in one of the world's most developed nations. The numbers are staggering. 1. The Las Vegas mass shooting wasn't the only mass shooting in America on Sunday While the scale of the attack in Las Vegas on Sunday night is unparalleled, it wasn't the only mass shooting to occur in the US that day. Some 13,000 miles away in Lawrence, just outside the University of Kansas in Kansas, two men and a woman were killed and a further two people injured in a mass shooting incident. While none of the three victims were students at the university, all were in their early twenties, with one of the young men recently having become a father, according to the local press. Mass shootings in America - defined as an event where at least four people are shot - are now an every day event. The Las Vegas attack makes October the most deadly month for mass shootings this year - although not by as much as some may think, given the scale of the atrocity. The scale of US mass shootings in 2017 2. One major mass shooting every two months This year's deaths follow a depressing trend, according to data gathered by the Gun Violence Archive. Some 346 people are estimated to have been killed in American mass shootings this year. This compared to 432 in 2016, and 369 in 2015 - more than one person for every day of the year. When it comes to major mass shootings (where more than four people are killed), there have been an average of just 72 days between events during the period of 2010 to 2017 . This is a far more frequent rate when compared to the average gap of 162 days from 2000 to 2010, according to data compiled by Mother Jones. The two worst mass shooting events - this week's Las Vegas shooting and the Pulse nightclub atrocity in Orlando - have occurred in the last two years. More than a person a day have been killed in US mass shootings in recent years 3. Firearms sales go up after mass shootings Data from the FBI shows us that there have been 270million firearms background checks since November 1998 - and the number is increasing as time goes by. Such background checks, initiated through the National Instant Criminal Background Check System (NICS), do not represent the number of firearms sold - but they do give us an idea as to interest in buying guns across the country. In an alarming pattern identified by the New York Times, the fear of firearms restrictions is a significant driver of gun sales - with mass shootings and other attacks being another, although to a lesser extent. For example, December 2015 saw the highest number of background checks to date - at 3.3m. This followed the San Bernardino terror attack in November, in which 14 people died and after which Obama called for tighter restrictions on the purchase of assault rifles. Firearm checks peak after attacks and potential restrictions 4. 270m guns for 320m people In 2007, the Small Arms Survey estimated that there were between 250m and 290m civilian-owned firearms in the US - a rate of around 90 per 100 people. This was the highest rate of civilian guns for any of the 178 countries that were surveyed and was ahead of Yemen (55 guns per 100 civilians) in second place by quite some distance. Higher rates of gun ownership correlate strongly with occurrences of mass shootings with the US emerging at the top of tree when it came to mass shootings per head in a study by Jaclyn Schildkraut of the State University of New York.  Countries with more guns have more mass shootings 5. Mass shootings are just the tip of the iceberg Between 2001 and 2013, 406,496 people died as a result of gun violence in America according to the Centre for Disease Control and Prevention. Of this number the majority - 237,052 - were actually suicides as opposed to homicides. Homicides accounted for 153,144 deaths over this period while the rest comprised 8,383 accidental deaths, 4,778 deaths from police shootings and 3,200 where the cause couldn't be determined.  In this context, mass shootings make up a comparatively small proportion of overall gun deaths in the US, accounting for around three per cent of homicides in 2017 so far according to the Gun Violence Archive. Suicides account for most US gun deaths 6. Texas is often at the frontline of mass shootings In 2015, there were 45 deaths from Texan mass shootings. In 2016, the state saw 39 victims. This year, the running total is 28. While individual large tragedies may skew the data for particular years, Texas is consistently bad for gun violence. After the Las Vegas attack, Nevada has suffered the most deaths from mass shootings this year - at 59 deaths - but it is also top when we make the number proportional to a state's population. It being a small state, Nevada has now had 20 mass shooting deaths per one million of its people - with the next highest rates seen in Mississippi (7.4 per million) and Kansas (3.4 per million). Map: America’s mass shootings hotspots 7. Americans can't agree on gun control The debate over gun rights and restrictions is not a new one in America - and it's opened up every time another mass shooting catches the public's attention.  The latest polling from the Pew Research Centre shows that 47 per cent of Americans support protecting gun rights - compared to 51 per cent who support gun control (6 April 2017). This polling has tightened over the last two decades - when 65 per cent were in favour of gun control in May 1999 - ensuring that the debate continues to rage on. The gun debate is anything but settled At the end of 2016, The Telegraph published a piece called \"The face of America's gun problem\" which aimed to document all 432 victims of American mass shootings in 2016.","published_at":1507519247,"content_id":"4e8c0637-b84b-395d-b695-f6cbda9c62a1","content_url":"https:\/\/www.yahoo.com\/news\/one-mass-shooting-every-day-112203494.html","content_published_at":1507533464,"content_relative_time":14,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-0a1a15a2-bcdd-3963-944b-cc43cd983b22_a-765e22f8-c506-3330-9b09-bec1750bedd9","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/protesters-outraged-over-deadly-police-shooting-utah-021713143--abc-news-topstories-5jp5zm2","author":"DeltaBravo","provider":"Good Morning America","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/gma\/protesters-outraged-over-deadly-police-shooting-utah-021713143--abc-news-topstories.html","img":"http:\/\/media.zenfs.com\/en-US\/video\/video.abcnewsplus.com\/c8d074775f62889615ee48ba8333c408","title":"Protesters outraged over deadly police shooting in Utah","summary":"Black Lives Matter demonstrators gathered outside police headquarters in Salt Lake City this afternoon to protest a prosecutor's decision not to file charges against a police officer who fatally shot a 50-year-old man. Lex Scott, an organizer with Black Lives Matter in Utah, said last week that the community wants Salt Lake County District Attorney Sim Gill to resign. The Harmon family, which lives in Colorado and St. Louis, is \"shell shocked,\" Scott said, according to The Associated Press.","published_at":1507518365,"content_id":"765e22f8-c506-3330-9b09-bec1750bedd9","content_url":"https:\/\/www.yahoo.com\/gma\/protesters-outraged-over-deadly-police-shooting-utah-021713143--abc-news-topstories.html","content_published_at":1507518365,"content_relative_time":18,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1b84655e-ba59-30f3-83d6-28c9cc3d861c_a-edf2da64-54ea-3cbe-ac36-63f42d141855","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/dutertes-rating-hit-steepest-drop-amid-drug-killings-26ewode","author":"rocky.j.mountain","provider":"Associated Press","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/dutertes-rating-hit-steepest-drop-amid-drug-killings-154111564.html","img":"http:\/\/media.zenfs.com\/en_us\/News\/ap_webfeeds\/214370bc330649d4b7369db220944cfe.jpg","title":"Duterte losing favor amid drug killings, wealth allegations","summary":"MANILA, Philippines (AP) — Filipinos' satisfaction with President Rodrigo Duterte has made its steepest drop since he took office last year amid an outcry over unabated drug killings and unresolved allegations that he has unexplained wealth, an independent poll showed.","published_at":1507516384,"content_id":"edf2da64-54ea-3cbe-ac36-63f42d141855","content_url":"https:\/\/www.yahoo.com\/news\/dutertes-rating-hit-steepest-drop-amid-drug-killings-154111564.html","content_published_at":1507516384,"content_relative_time":19,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-224ac3be-d224-307e-a28a-997310567f01_a-81432f54-e9de-38dc-b136-b717e42d0e19","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/police-home-invader-shot-multiple-62l3txn","author":"third_watch","provider":"Chicago Sun-Times","lead_attribution":"provider","link":"https:\/\/chicago.suntimes.com\/news\/police-home-invader-gets-shot-multiple-times-in-bronzeville\/","img":"https:\/\/s1.yimg.com\/uu\/api\/res\/1.2\/bENham8V8.z9sEGkKLeXSg--\/dz0xMDI0O2g9NjMwO3RhZz1vcmlnaW5hbDthcHBpZD15bmV3cw--\/http:\/\/streambe.zenfs.com\/streambe\/streambe_81432f54-e9de-38dc-b136-b717e42d0e19-2106119139.jpeg","title":"Police: Home invader shot multiple times in Bronzeville","summary":"A homeowner opened fire on a man who was trying to break into a residence late Saturday in the Bronzeville neighborhood on the South Side, police said. A 44-year-old man suffered multiple gunshot wounds to the body at 10:54 p.m. as he was trying to break into a home in the 4500 block of South St. Lawrence, according to Chicago Police. The homeowner told investigators that he opened fire after the man forced his way into the home with a crowbar, police said. The suspect then jumped into a vehicle, which fled to Mercy Hospital. The man was expected to be transferred in critical condition to Stroger Hospital. The homeowner, a 60-year-old man, has a valid FOID card and concealed carry permit, police","published_at":1507515718,"content_id":"81432f54-e9de-38dc-b136-b717e42d0e19","content_url":"https:\/\/chicago.suntimes.com\/news\/police-home-invader-gets-shot-multiple-times-in-bronzeville\/","content_published_at":1507438440,"content_relative_time":41,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-d76d5d6b-3c5a-3aa2-ad04-dabeacd72741_a-5a09b5cd-d2bd-3377-ad71-99467aa12be0","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/least-12-dead-scores-missing-rohingya-capsize-officials-3jiex39","author":"third_watch","provider":"AFP","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/least-12-dead-scores-missing-rohingya-capsize-officials-024450462.html","img":"http:\/\/media.zenfs.com\/en_us\/News\/afp.com\/6ced06427272e32d6085320edfd3ff2c284c6f19.jpg","title":"At least 14 dead as Rohingya refugee boat sinks off Bangladesh","summary":"At least 14 Rohingya refugees, most of them children, drowned and scores more were missing Monday after their overloaded boat capsized, the latest tragedy to strike those fleeing violence in Myanmar. Authorities in Bangladesh said the boat was carrying 60 to 100 people when it overturned and sank in rough seas on Sunday night. The bodies of 11 children, two women and a man were washed up on Shah Porir Dwip island in Bangladesh and border guards pulled 13 survivors from the sea, but the fate of the others remains unknown.","published_at":1507514188,"content_id":"5a09b5cd-d2bd-3377-ad71-99467aa12be0","content_url":"https:\/\/www.yahoo.com\/news\/least-12-dead-scores-missing-rohingya-capsize-officials-024450462.html","content_published_at":1507570144,"content_relative_time":4,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-6eeccbc6-c091-3930-96bc-7bc5aadcd761_a-1cbe2b44-0c39-3833-826b-17acd37fab27","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/man-found-missing-girl-gives-2l832p6","author":"ipostwhaticareabout","provider":"New York Post","lead_attribution":"provider","link":"http:\/\/nypost.com\/2017\/10\/08\/man-who-found-missing-girl-gives-his-7k-reward-to-her\/","img":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/_fc2hrrreAifbN7Z4iBBIw--\/dz0xMjAwO2g9ODAwO3RhZz1vcmlnaW5hbDthcHBpZD15bmV3cw--\/http:\/\/streambe.zenfs.com\/streambe\/streambe_1cbe2b44-0c39-3833-826b-17acd37fab27--1453843432.jpeg","title":"Man who found missing girl gives his $7K reward to her","summary":"A Minnesota farmer was presented with a $7,000 reward for finding a missing teenage girl — and then just moments later gave the money to the girl, who was a captive of three men for a month. Earl Melchert, 65, of Barrett, turned the reward money over to the girl Friday at police headquarters. “Today we witnessed an incredible example of kindness,” Alexandria Police Chief Rick Wyffels said on Facebook. The 15-year-old girl was abducted from her home on Aug. 8 in Alexandria, Minn., and taken to an abandoned house where she was physically and sexually assaulted. Fox News does not name alleged victims of sexual assault without their consent. Fox 9 Minneapolis reported that the girl escaped Sept.","published_at":1507514008,"content_id":"1cbe2b44-0c39-3833-826b-17acd37fab27","content_url":"http:\/\/nypost.com\/2017\/10\/08\/man-who-found-missing-girl-gives-his-7k-reward-to-her\/","content_published_at":1507507171,"content_relative_time":21,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-c25841d7-4754-39a0-ab53-5367433f593c_a-25ce60a7-cb48-3853-84f9-dde5d1a3bb7e","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/las-vegas-gunmans-nightstand-note-contained-figures-wind-004500302--abc-news-topstories-3gdjeh8","author":"third_watch","provider":"Good Morning America","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/gma\/las-vegas-gunmans-nightstand-note-contained-figures-wind-004500302--abc-news-topstories.html","img":"http:\/\/media.zenfs.com\/en_us\/gma\/us.abcnews.gma.com\/las-vegas-shooting-mandalay-bay-hotel-rt-jt-171008_16x9_992.jpg","title":"Las Vegas gunman's nightstand note contained figures for wind, trajectory and distance: Officials","summary":"A note containing handwritten numbers for wind, trajectory, and distance was discovered by Stephen Paddock's body inside the Las Vegas hotel room where he took his life last Sunday after slaughtering 58 people and injuring hundreds, officials have confirmed. Law enforcement officials briefed on the investigation confirmed to ABC News on Sunday that the note found on Paddock's hexagon-shaped nightstand contained such numerical figures. Pressed about what the meaning of the numbers were, Newton said, Paddock \"must have done the calculations online or something, to figure out what his altitude was going to be, and how high up he was -- how far out the crowd was going to be, and what -- at that distance -- and what the drop of his bullet was going to be.","published_at":1507502867,"content_id":"25ce60a7-cb48-3853-84f9-dde5d1a3bb7e","content_url":"https:\/\/www.yahoo.com\/gma\/las-vegas-gunmans-nightstand-note-contained-figures-wind-004500302--abc-news-topstories.html","content_published_at":1507509900,"content_relative_time":21,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1fc17dd4-591d-3b3d-abfd-d0b6dbd0578e_a-70991b4c-61be-3aef-81f1-5d45731f801b","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1fc17dd4-591d-3b3d-abfd-d0b6dbd0578e_a-70991b4c-61be-3aef-81f1-5d45731f801b","author":"nanook","provider":"USA Today","lead_attribution":"provider","link":"https:\/\/www.usatoday.com\/story\/news\/nation-now\/2017\/10\/08\/las-vegas-shooting-retired-cop-told-friends-im-going-back-in-dont-come-after-me\/744850001\/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatoday-newstopstories","img":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/bpbod.31SfVsAoU01x0psw--\/dz0xNjAwO2g9ODAwO3RhZz1vcmlnaW5hbDthcHBpZD15bmV3cw--\/http:\/\/streambe.zenfs.com\/streambe\/streambe_70991b4c-61be-3aef-81f1-5d45731f801b--1648047475.jpeg","title":"Las Vegas shooting: Retired cop told friends, 'I'm going back in, don't come in after me'","summary":"Police: No motive determined in Vegas shooting First responders describe Vegas massacre chaos Coroner says all Vegas victims now identified Kellyanne Conway calls for 'thoughtful conversation' after Las Vegas Stephen Paddock's girlfriend hoped for 'quiet future' with him Celine Dion donates Vegas show proceeds to victims Report: Police searching for mystery woman seen with Las Vegas shooter Richie: 'We cannot sweep Vegas under the rug' Police release timeline of deadly Las Vegas shooting Lawyer: Girlfriend didn't know of attack plans Texas shop sold guns to Vegas shooter Survivor stories: Shooting victims share fight to live Trump: We are with Vegas '100%' #VegasStrong: Kindness abounds after","published_at":1507501044,"content_id":"70991b4c-61be-3aef-81f1-5d45731f801b","content_url":"https:\/\/www.usatoday.com\/story\/news\/nation-now\/2017\/10\/08\/las-vegas-shooting-retired-cop-told-friends-im-going-back-in-dont-come-after-me\/744850001\/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatoday-newstopstories","content_published_at":1507504212,"content_relative_time":22,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-783b98a9-d88a-3322-b538-98e96f4fed45_a-231b9464-1766-31db-834c-1dd001c0664c","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/diwali-festival-lights-yorks-times-37lzyq6","author":"nanook","provider":"HuffPost","lead_attribution":"provider","link":"http:\/\/www.huffingtonpost.com\/entry\/diwali-festival-new-york-times-square_us_59d518fde4b04b9f9207066a","img":"https:\/\/s1.yimg.com\/uu\/api\/res\/1.2\/BwvypveZe3_YAZnuWxGbyw--\/dz0xOTEwO2g9MTAwMDt0YWc9b3JpZ2luYWw7YXBwaWQ9eW5ld3M-\/http:\/\/streambe.zenfs.com\/streambe\/streambe_231b9464-1766-31db-834c-1dd001c0664c--1738371536.jpeg","title":"Diwali Festival Lights Up New York's Times Square","summary":"NEW YORK ― New York City's iconic Times Square transformed into a vision of South Asian culture on Saturday, as thousands of revelers gathered for an early celebration of Diwali, the Hindu festival of lights. Diwali, also known as Deepavali, is the biggest and most important holiday in India. It lasts for five days, and coincides with the Hindu new year. Hindus, Jains, Buddhists and Sikhs celebrate the religious occasion every autumn in countries throughout South Asia and beyond. In the United States, major Diwali festivals have lit up communities from California to Texas to North Carolina in recent years. The massive Times Square event ― the largest Diwali celebration outside of India ― has","published_at":1507489640,"content_id":"231b9464-1766-31db-834c-1dd001c0664c","content_url":"http:\/\/www.huffingtonpost.com\/entry\/diwali-festival-new-york-times-square_us_59d518fde4b04b9f9207066a","content_published_at":1507424365,"content_relative_time":44,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-7707153d-10b1-3b53-9cc1-05b718484154_a-46087e14-ad5e-3e12-9d8d-a673b2217412","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/search-continues-driver-car-believed-4thi5hc","author":"rocky.j.mountain","provider":"latimes.com","lead_attribution":"provider","link":"http:\/\/www.latimes.com\/local\/lanow\/la-me-ln-racing-fatal-20171008-htmlstory.html","img":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/jNwvBI1WyVtRFiCmyWJ9Gw--\/dz0yMDAwO2g9MTEyNDt0YWc9b3JpZ2luYWw7YXBwaWQ9eW5ld3M-\/http:\/\/streambe.zenfs.com\/streambe\/streambe_46087e14-ad5e-3e12-9d8d-a673b2217412-303233867.jpeg","title":"Search continues for driver of car believed to be racing with vehicle that crashed, killing its four occupants","summary":"Authorities are continuing their search for the driver of a car they believe was racing with another vehicle that crashed into a tree in Northridge, killing all four occupants. The crash occurred about 11 p.m. Friday, when the driver of a silver BMW lost control of the car while speeding east on Lassen Street alongside a dark-colored sedan, said Officer Shane Bales of the Los Angeles Police Department. The BMW crossed into oncoming traffic lanes near Balboa Boulevard and hit a light pole before slamming into a tree. Flames engulfed the car, and the impact was so severe that it ejected the car's engine, Bales said. The car broke into several pieces. Authorities believe the cars were traveling","published_at":1507484146,"content_id":"46087e14-ad5e-3e12-9d8d-a673b2217412","content_url":"http:\/\/www.latimes.com\/local\/lanow\/la-me-ln-racing-fatal-20171008-htmlstory.html","content_published_at":1507498256,"content_relative_time":24,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-889dd4bd-3440-3cee-a7e0-d5b53787171b_a-2ab05390-af0a-3101-b531-98207f8db2da","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/irate-68-old-man-clings-3ab7ght","author":"third_watch","provider":"KTRK – Houston","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/irate-68-old-man-clings-145830084.html","img":"http:\/\/media.zenfs.com\/en-US\/video\/video.krtk.abc.news.com\/b521ebf3850774c951d23c013cc790a1","title":"Irate 68-year-old man clings to moving school bus after bottle thrown at him","summary":null,"published_at":1507474895,"content_id":"2ab05390-af0a-3101-b531-98207f8db2da","content_url":"https:\/\/www.yahoo.com\/news\/irate-68-old-man-clings-145830084.html","content_published_at":1507474710,"content_relative_time":30,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-c5a8fad9-18ab-3062-8696-0a6a2568688e_a-514e475b-ebe5-3d31-aabd-bb1729807cd2","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/senior-catholic-cleric-resigns-secret-1bv9nlg","author":"ipostwhaticareabout","provider":"The Telegraph","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/senior-catholic-cleric-resigns-secret-140905538.html","img":"http:\/\/media.zenfs.com\/en-GB\/homerun\/the_telegraph_258\/a68dd4682804cb45abb697b9aef8ad77","title":"Senior Catholic cleric resigns after secret family revealed","summary":"The former rector of a prominent Legion of Christ seminary in Rome is leaving the priesthood after admitting to having a secret family, including two children of his own, which he concealed for years from Roman Catholic authorities.  The conservative Catholic order announced this weekend that Father Oscar Turrion, a popular 49-year-old Spanish priest who was made rector of the Pontifical Maria Matter Ecclesiae International College in Rome in 2014, will leave the priestly ministry in order to dedicate more time to a family he has raised clandestinely until now.   Back in March, Father Turrion first told his superiors at the Pontifical Maria Matter Ecclesiae International College, which houses approximately 100 male diocesan seminarians from around the globe, that he had recently fathered a daughter. As Roman Catholic priests are bound to a vow of celibacy, the order offered him a “period of reflection,” and then in August appointed a substitute rector.   The Legion revealed this week that Father Turrion told authorities in a letter he had decided to leave the ministry after admitting that his infant daughter is in fact the second child he fathered with a woman he fell in love with several years ago when the order was going through a period of turmoil. He kept the first-born child, a son reportedly born eight years ago, and the ongoing relationship with the child’s mother, a closely guarded secret for years, including during the period he was being considered for rector. In a letter released by the Legion, Turrion asked for prayers and \"foregiveness for the scandal . . for my bad example.\"  Popular and passionate about football,  Father Turrion was one of the few ordained priests invited each year to join the seminarians on the field in the Clericus Cup, an annual football tournament between teams from the Rome seminary colleges. The shock revelation has rattled the institution, which said in a statement it was saddened and \"conscious of the impact that the negative example\" had set to seminarians and the Christian faithful. The order faced a similar scandal in 2013, when American priest Thomas Williams, a professor of moral theology at the Legion’s university in Rome and a prominent TV commentator, also announced he would leave the priesthood after admitting he had fathered a child. And in 2006 the Vatican sentenced its founder, Mexican Father Marcial Maciel Delgollado to a life of “prayer and penance” after discovering he had sexually abused seminarians and fathered at least three children out of wedlock.  Today, the subject of how to manage priests secretly fathering children is gradually becoming less taboo inside the Vatican, thanks in part to the persistent efforts of Vincent Doyle, an Irish Catholic psychotherapist who discovered that his father had been a priest and went on to found the Coping International support group for children of priests, who he said often face emotional, psychological and financial difficulties after years of living with “guilty secrets.\"  Earlier this year Irish Catholic bishops passed new guidelines for “the principles of responsibility regarding priests who father children while in the ministry,” urging the wellbeing of the child to be put first, personally, legally and financially.   ","published_at":1507472012,"content_id":"514e475b-ebe5-3d31-aabd-bb1729807cd2","content_url":"https:\/\/www.yahoo.com\/news\/senior-catholic-cleric-resigns-secret-140905538.html","content_published_at":1507471745,"content_relative_time":31,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-8c6850fd-6653-303f-967e-64634a7857c0_a-7a504019-7e99-3306-a34a-0a0dab2dc345","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/indigenous-peoples-day-italians-stick-columbus-4yhvte6","author":"rocky.j.mountain","provider":"Associated Press","lead_attribution":"provider","link":"https:\/\/finance.yahoo.com\/news\/indigenous-peoples-day-italians-stick-columbus-140851002.html","img":"http:\/\/globalfinance.zenfs.com\/images\/US_AHTTP_AP_NEWSBRIEFS\/f8aeff212f3b42778f955d3325a48a71_original.jpg","title":"Indigenous Peoples Day? Italians say stick with Columbus","summary":"Is it time to say \"arrivederci\" to Christopher Columbus? A movement to abolish Columbus Day and replace it with Indigenous Peoples Day has gained momentum in some parts of the U.S., with Los ...","published_at":1507471945,"content_id":"7a504019-7e99-3306-a34a-0a0dab2dc345","content_url":"https:\/\/finance.yahoo.com\/news\/indigenous-peoples-day-italians-stick-columbus-140851002.html","content_published_at":1507471914,"content_relative_time":31,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1d3286ef-a5fc-316c-8397-257bc929722d_a-88a963fe-670f-3207-a153-699d727897a0","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/video-deadly-utah-police-shooting-yc1c38n","author":"nanook","provider":"CBS News","lead_attribution":"provider","link":"https:\/\/www.cbsnews.com\/news\/patrick-harmon-death-utah-police-shooting-captured-on-camera\/","img":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/MCrQvgB2cSqzNuepuzxR4Q--\/dz05ODY7aD01NTU7dGFnPW9yaWdpbmFsO2FwcGlkPXluZXdz\/http:\/\/streambe.zenfs.com\/streambe\/streambe_88a963fe-670f-3207-a153-699d727897a0--1033517804.jpeg","title":"Video of deadly Utah police shooting sparks outcry","summary":"SALT LAKE CITY --  A Utah prosecutor this week determined police were legally justified in the deadly shooting of a black man in August that was captured on body camera video, enraging anti-police brutality groups and the family of the man who was fatally shot. While one video appears to show the victim, Patrick Harmon, 50, shot from behind as he ran from police, a slowed-down version shows he pivoted toward officers with a knife, Salt Lake County District Attorney Sim Gill said Friday. Officer Clinton Fox told investigators Harmon threatened to stab him before he fired the fatal shots. Body camera video shows Fox shot Harmon at close range after Fox yells, \"I'll f....ing shoot you.\" Harmon's","published_at":1507467351,"content_id":"88a963fe-670f-3207-a153-699d727897a0","content_url":"https:\/\/www.cbsnews.com\/news\/patrick-harmon-death-utah-police-shooting-captured-on-camera\/","content_published_at":1507467288,"content_relative_time":33,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-049df59b-5f36-3524-afd6-c6da6b287644_a-f5a3b38d-543e-33db-8a5c-873ea8bc9333","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/small-plane-crashes-killing-reston-656xk03","author":"ipostwhaticareabout","provider":"Washington Post","lead_attribution":"provider","link":"https:\/\/www.washingtonpost.com\/local\/public-safety\/small-plane-crashes-killing-reston-man\/2017\/10\/07\/ff4d7968-abaa-11e7-850e-2bdd1236be5d_story.html","img":null,"title":"Small plane crashes, killing Reston man","summary":"A 76-year-old Reston man was killed Saturday in the crash of a single engine private plane that had been towing a glider near Front Royal, Va., the Virginia state police said. The victim was identified as Steven B. Zaboji, the pilot of the Piper Pawnee that crashed and caught fire just outside Front Royal Airport. Zaboji had been towing a glider, and after the glider disconnected, the Piper began experiencing problems, the state police said. It crashed onto private property near the airport and the impact ignited a fire, the police said. They said Zaboji died at the scene. The glider landed safely. No injuries on the ground were reported. The matter is under investigation.","published_at":1507465847,"content_id":"f5a3b38d-543e-33db-8a5c-873ea8bc9333","content_url":"https:\/\/www.washingtonpost.com\/local\/public-safety\/small-plane-crashes-killing-reston-man\/2017\/10\/07\/ff4d7968-abaa-11e7-850e-2bdd1236be5d_story.html","content_published_at":1507458300,"content_relative_time":35,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-e85ab090-9674-31f8-bd02-d7a0339d9873_a-00073f53-5691-300e-80b3-0a240f308bfb","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/man-raped-12-old-awarded-57aherv","author":"DeltaBravo","provider":"The Independent","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/man-raped-12-old-awarded-114904992.html","img":"http:\/\/media.zenfs.com\/en-GB\/homerun\/the_independent_635\/f3abe3948067ca56acaafb2cde4a6bc7","title":"Man who raped 12-year-old awarded joint custody of her child","summary":"A man who raped a 12-year-old has been awarded joint custody of her child despite being convicted of her rape and another sexual assault on a child. A judge has given Christopher Mirasolo, 27, parenting time and joint legal custody of the eight-year-old boy after a paternity test found he was the father. Since his conviction for the rape in 2008, Mirasolo, from Brown City, Michigan, has been convicted of another child sex assault, for which he served four years in prison.","published_at":1507463592,"content_id":"00073f53-5691-300e-80b3-0a240f308bfb","content_url":"https:\/\/www.yahoo.com\/news\/man-raped-12-old-awarded-114904992.html","content_published_at":1507463344,"content_relative_time":34,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-dc4a6f84-195a-3004-94dc-6eabd68c7a7d_a-78e6cd63-d0ad-3bcd-860a-277e17c773bb","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/srebrenica-hero-naser-oric-awaits-war-crimes-verdict-95gkah9","author":"DeltaBravo","provider":"AFP","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/srebrenica-hero-naser-oric-awaits-war-crimes-verdict-105917273.html","img":"http:\/\/media.zenfs.com\/en_us\/News\/afp.com\/Part-PAR-APP2003041160511-1-0-1.jpg","title":"Srebrenica 'hero' Naser Oric awaits war crimes verdict","summary":"A Sarajevo court on Monday will deliver a keenly awaited verdict on whether Naser Oric, who is revered by many as a heroic defender of Muslims during Bosnia's bloody war but viewed as a butcher by Serbs, is a war criminal. The handsome 50-year-old was bodyguard to former Yugoslav president Slobodan Milosevic and is one of only a few Bosnian Muslim commanders to have faced trial for atrocities committed against Serbs. An old photograph shows a long-haired youth who defended the eastern town of Srebrenica, where some 8,000 Muslim men and boys were eventually massacred by Serb forces, the worst atrocity in Europe since World War II.","published_at":1507460574,"content_id":"78e6cd63-d0ad-3bcd-860a-277e17c773bb","content_url":"https:\/\/www.yahoo.com\/news\/srebrenica-hero-naser-oric-awaits-war-crimes-verdict-105917273.html","content_published_at":1507460357,"content_relative_time":34,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-3e05b536-dd80-31af-bc8c-d4931b5346ff_a-79471620-7c29-344e-9745-d3f4ceec3d8c","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/natural-history-museum-donald-trump-4x853i0","author":"DeltaBravo","provider":"The Independent","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/natural-history-museum-donald-trump-224532595.html","img":"http:\/\/media.zenfs.com\/en-GB\/homerun\/the_independent_635\/133d9d42d34e10ffc368de963b7ebf91","title":"Natural History Museum: Donald Trump Jr 'likes' tweet reporting Sadiq Khan's comments about victims injured in London car crash","summary":"As speculation swirled about the car crash outside the Natural History Museum, Donald Trump’s son “liked” a tweet which quoted London Mayor Sadiq Khan as saying a number of people had been injured and a man detained by police. Donald Trump Jr was responding to the report about the incident by US broadcaster ABC News, clicking the like button on their story about the incident. A large number of Twitter users but not ABC News had claimed it was a terrorist attack.","published_at":1507450562,"content_id":"79471620-7c29-344e-9745-d3f4ceec3d8c","content_url":"https:\/\/www.yahoo.com\/news\/natural-history-museum-donald-trump-224532595.html","content_published_at":1507416332,"content_relative_time":47,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-b747064a-a408-3f18-bd91-530a12434dc4_a-df066ac9-3a0c-38fb-be10-a8769b00b0ac","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/death-teen-found-inside-hotel-3m9auat","author":"DeltaBravo","provider":"People","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/death-teen-found-inside-hotel-213559059.html","img":"http:\/\/media.zenfs.com\/en-us\/video\/video.people.time.com\/e15980d88495a628a46b4213f53087e3","title":"Death of Teen Who Was Found Inside a Hotel’s Freezer Has Been Ruled an Accident","summary":null,"published_at":1507433230,"content_id":"df066ac9-3a0c-38fb-be10-a8769b00b0ac","content_url":"https:\/\/www.yahoo.com\/news\/death-teen-found-inside-hotel-213559059.html","content_published_at":1507412159,"content_relative_time":48,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-fb74d55f-5918-34db-ae33-c645d0ed7f69_a-1f676d9d-5564-307d-a9d7-215451ff240a","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/principal-fired-trying-smuggle-heroin-445ex8y","author":"DeltaBravo","provider":"New York Post","lead_attribution":"provider","link":"http:\/\/nypost.com\/2017\/10\/07\/principal-fired-for-trying-to-smuggle-heroin-into-prison\/","img":"https:\/\/s1.yimg.com\/uu\/api\/res\/1.2\/Pq_owSUavzVeVgKEd4CXZw--\/dz0xMjAwO2g9ODU3O3RhZz1vcmlnaW5hbDthcHBpZD15bmV3cw--\/http:\/\/streambe.zenfs.com\/streambe\/streambe_1f676d9d-5564-307d-a9d7-215451ff240a-1414357644.jpeg","title":"Principal fired for trying to smuggle heroin into prison","summary":"A once-respected Brooklyn principal has lost a bid to keep her job after admitting she tried to smuggle heroin and other drugs into an upstate prison, The Post has learned. Sadie Silver, a rising star at PS 28 in Bedford-Stuyvesant, was busted in July 2014 — but continued to collect her city salary, which was $138,000 last year, until March this year. Silver and a boyfriend were arrested on charges of drug possession, bringing contraband into a prison, and endangering the welfare of a child. Silver brought her daughter to Coxsackie Correctional Facility. She and her boyfriend were caught with bags of heroin and suboxone, authorities said. They allegedly tried to sneak the drugs to Silver's son,","published_at":1507431488,"content_id":"1f676d9d-5564-307d-a9d7-215451ff240a","content_url":"http:\/\/nypost.com\/2017\/10\/07\/principal-fired-for-trying-to-smuggle-heroin-into-prison\/","content_published_at":1507428314,"content_relative_time":43,"vibe_name":"Society & Culture"}]