[{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-511fde00-6451-3a83-8bf8-43dfb3129f22_a-99e096e0-6bd0-3300-a3d9-21dd36da599b","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/chelsea-manning-finds-sympathetic-crowd-ny-appearance-6a2muo5","author":"third_watch","provider":"Associated Press","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/chelsea-manning-finds-sympathetic-crowd-ny-appearance-054645333.html","img":"http:\/\/media.zenfs.com\/en_us\/News\/ap_webfeeds\/fd5fe879dc73431ca5b039281b5a7710.jpg","title":"Chelsea Manning finds a sympathetic crowd in NY appearance","summary":"NEW YORK (AP) — She may have been disinvited by Harvard and turned away from Canada, but Chelsea Manning earned applause, laughter and even some tears of empathy on Sunday from a friendly crowd at the annual New Yorker Festival.","published_at":1507528145,"content_id":"99e096e0-6bd0-3300-a3d9-21dd36da599b","content_url":"https:\/\/www.yahoo.com\/news\/chelsea-manning-finds-sympathetic-crowd-ny-appearance-054645333.html","content_published_at":1507528097,"content_relative_time":11,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1d3403d0-e689-3e2e-9f5e-e4cf17deceb7_a-0e2a081b-e66f-3b06-8f10-4fbbdf6760ea","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1d3403d0-e689-3e2e-9f5e-e4cf17deceb7_a-0e2a081b-e66f-3b06-8f10-4fbbdf6760ea","author":"ipostwhaticareabout","provider":"Mashable","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/trump-feeling-really-really-under-020639524.html","img":"http:\/\/media.zenfs.com\/en-US\/homerun\/news.mashable\/57f737af3ef12fb0f056f6622c204b0d","title":"Trump is feeling really, really under-appreciated for his Puerto Rico efforts, you guys","summary":"Trump's latest tweet about Puerto Rico is certainly on-brand, to say the least. The U.S. president uploaded a supercut video of the relief efforts in Puerto Rico following Hurricane Maria, a 1984-esque piece of propaganda that's more about receiving the credit for helping, rather than well, actually helping. SEE ALSO: FEMA omits statistics on Puerto Rico hurricane response from website Titled \"What the fake news media will not show you in Puerto Rico,\" the eight-minute video consists of a mishmash of footage from various agencies, ending with Trump shaking people's hands in the four hours that he was there. \"Nobody could have done what I've done for #PuertoRico with so little appreciation. So much work!\" Trump tweeted.  Of course, the video comes following criticism of the Trump administration's handling of the disaster — and handling of paper towels. Namely, criticism comes from San Juan Mayor Carmen Yulín Cruz, whose complaints were rebuffed as \"political noise\" by FEMA administrator Brock Long. Power collapses in San Juan hospital with 4 patients now being transferred out. Have requested support from FEMA. NOTHING! @DavidBegnaud — Carmen Yulín Cruz (@CarmenYulinCruz) October 8, 2017 The death toll following the Category 4 storm on Sept. 20 stands at 36, but is expected to rise as hospitals still struggle almost three weeks after the disaster hit. The island is still largely without basic utilities: Approximately 56.8 percent of its people have drinking water, and a tiny 11.7 percent of people have electricity.  But don't worry about all that. Worry about Trump not getting the plaudits that he's so very used to, because that's what he'd want you to do. The biggest tragedy about #PuertoRico is, first and foremost, the lack of appreciation for you. https:\/\/t.co\/EC3XXQ1vO2 — Patton Oswalt (@pattonoswalt) October 9, 2017 Remarkable narcissism. There's really no more debate. Ego before country, enabled by a faithful base. https:\/\/t.co\/NQDF56glKT — David Jolly (@DavidJollyFL) October 9, 2017 Thanks for doing your job Mr. President. Next time, try using the word \"we\" to describe these efforts and future ones. https:\/\/t.co\/wRurJCvmnu — Michael McFaul (@McFaul) October 9, 2017 WATCH: Los Angeles is painting their roads white to cool the city down and improve air quality","published_at":1507524634,"content_id":"0e2a081b-e66f-3b06-8f10-4fbbdf6760ea","content_url":"https:\/\/www.yahoo.com\/news\/trump-feeling-really-really-under-020639524.html","content_published_at":1507514799,"content_relative_time":14,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-17bd392d-ddf9-3485-be6c-2d20bd4d0036_a-4e8c0637-b84b-395d-b695-f6cbda9c62a1","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/one-mass-shooting-every-day-7wj5f2l","author":"nanook","provider":"The Telegraph","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/one-mass-shooting-every-day-112203494.html","img":"http:\/\/media.zenfs.com\/en-GB\/homerun\/the_telegraph_258\/d5524befeaa12fae8b3b4c6bf39f7e26","title":"One mass shooting every day: Seven facts about gun violence in America","summary":"Stephen Paddock's gun attack at a Las Vegas country music festival has left at least 59 people dead. It was the deadliest mass shooting in modern US history, once again highlighting America's extreme rate of gun violence. The frequency of this kind of event risks anaesthetising us to the number of people who die from shootings in one of the world's most developed nations. The numbers are staggering. 1. The Las Vegas mass shooting wasn't the only mass shooting in America on Sunday While the scale of the attack in Las Vegas on Sunday night is unparalleled, it wasn't the only mass shooting to occur in the US that day. Some 13,000 miles away in Lawrence, just outside the University of Kansas in Kansas, two men and a woman were killed and a further two people injured in a mass shooting incident. While none of the three victims were students at the university, all were in their early twenties, with one of the young men recently having become a father, according to the local press. Mass shootings in America - defined as an event where at least four people are shot - are now an every day event. The Las Vegas attack makes October the most deadly month for mass shootings this year - although not by as much as some may think, given the scale of the atrocity. The scale of US mass shootings in 2017 2. One major mass shooting every two months This year's deaths follow a depressing trend, according to data gathered by the Gun Violence Archive. Some 346 people are estimated to have been killed in American mass shootings this year. This compared to 432 in 2016, and 369 in 2015 - more than one person for every day of the year. When it comes to major mass shootings (where more than four people are killed), there have been an average of just 72 days between events during the period of 2010 to 2017 . This is a far more frequent rate when compared to the average gap of 162 days from 2000 to 2010, according to data compiled by Mother Jones. The two worst mass shooting events - this week's Las Vegas shooting and the Pulse nightclub atrocity in Orlando - have occurred in the last two years. More than a person a day have been killed in US mass shootings in recent years 3. Firearms sales go up after mass shootings Data from the FBI shows us that there have been 270million firearms background checks since November 1998 - and the number is increasing as time goes by. Such background checks, initiated through the National Instant Criminal Background Check System (NICS), do not represent the number of firearms sold - but they do give us an idea as to interest in buying guns across the country. In an alarming pattern identified by the New York Times, the fear of firearms restrictions is a significant driver of gun sales - with mass shootings and other attacks being another, although to a lesser extent. For example, December 2015 saw the highest number of background checks to date - at 3.3m. This followed the San Bernardino terror attack in November, in which 14 people died and after which Obama called for tighter restrictions on the purchase of assault rifles. Firearm checks peak after attacks and potential restrictions 4. 270m guns for 320m people In 2007, the Small Arms Survey estimated that there were between 250m and 290m civilian-owned firearms in the US - a rate of around 90 per 100 people. This was the highest rate of civilian guns for any of the 178 countries that were surveyed and was ahead of Yemen (55 guns per 100 civilians) in second place by quite some distance. Higher rates of gun ownership correlate strongly with occurrences of mass shootings with the US emerging at the top of tree when it came to mass shootings per head in a study by Jaclyn Schildkraut of the State University of New York.  Countries with more guns have more mass shootings 5. Mass shootings are just the tip of the iceberg Between 2001 and 2013, 406,496 people died as a result of gun violence in America according to the Centre for Disease Control and Prevention. Of this number the majority - 237,052 - were actually suicides as opposed to homicides. Homicides accounted for 153,144 deaths over this period while the rest comprised 8,383 accidental deaths, 4,778 deaths from police shootings and 3,200 where the cause couldn't be determined.  In this context, mass shootings make up a comparatively small proportion of overall gun deaths in the US, accounting for around three per cent of homicides in 2017 so far according to the Gun Violence Archive. Suicides account for most US gun deaths 6. Texas is often at the frontline of mass shootings In 2015, there were 45 deaths from Texan mass shootings. In 2016, the state saw 39 victims. This year, the running total is 28. While individual large tragedies may skew the data for particular years, Texas is consistently bad for gun violence. After the Las Vegas attack, Nevada has suffered the most deaths from mass shootings this year - at 59 deaths - but it is also top when we make the number proportional to a state's population. It being a small state, Nevada has now had 20 mass shooting deaths per one million of its people - with the next highest rates seen in Mississippi (7.4 per million) and Kansas (3.4 per million). Map: America’s mass shootings hotspots 7. Americans can't agree on gun control The debate over gun rights and restrictions is not a new one in America - and it's opened up every time another mass shooting catches the public's attention.  The latest polling from the Pew Research Centre shows that 47 per cent of Americans support protecting gun rights - compared to 51 per cent who support gun control (6 April 2017). This polling has tightened over the last two decades - when 65 per cent were in favour of gun control in May 1999 - ensuring that the debate continues to rage on. The gun debate is anything but settled At the end of 2016, The Telegraph published a piece called \"The face of America's gun problem\" which aimed to document all 432 victims of American mass shootings in 2016.","published_at":1507519247,"content_id":"4e8c0637-b84b-395d-b695-f6cbda9c62a1","content_url":"https:\/\/www.yahoo.com\/news\/one-mass-shooting-every-day-112203494.html","content_published_at":1507533464,"content_relative_time":9,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-0a1a15a2-bcdd-3963-944b-cc43cd983b22_a-765e22f8-c506-3330-9b09-bec1750bedd9","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/protesters-outraged-over-deadly-police-shooting-utah-021713143--abc-news-topstories-5jp5zm2","author":"DeltaBravo","provider":"Good Morning America","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/gma\/protesters-outraged-over-deadly-police-shooting-utah-021713143--abc-news-topstories.html","img":"http:\/\/media.zenfs.com\/en-US\/video\/video.abcnewsplus.com\/c8d074775f62889615ee48ba8333c408","title":"Protesters outraged over deadly police shooting in Utah","summary":"Black Lives Matter demonstrators gathered outside police headquarters in Salt Lake City this afternoon to protest a prosecutor's decision not to file charges against a police officer who fatally shot a 50-year-old man. Lex Scott, an organizer with Black Lives Matter in Utah, said last week that the community wants Salt Lake County District Attorney Sim Gill to resign. The Harmon family, which lives in Colorado and St. Louis, is \"shell shocked,\" Scott said, according to The Associated Press.","published_at":1507518365,"content_id":"765e22f8-c506-3330-9b09-bec1750bedd9","content_url":"https:\/\/www.yahoo.com\/gma\/protesters-outraged-over-deadly-police-shooting-utah-021713143--abc-news-topstories.html","content_published_at":1507518365,"content_relative_time":13,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1b84655e-ba59-30f3-83d6-28c9cc3d861c_a-edf2da64-54ea-3cbe-ac36-63f42d141855","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/dutertes-rating-hit-steepest-drop-amid-drug-killings-26ewode","author":"rocky.j.mountain","provider":"Associated Press","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/dutertes-rating-hit-steepest-drop-amid-drug-killings-154111564.html","img":"http:\/\/media.zenfs.com\/en_us\/News\/ap_webfeeds\/214370bc330649d4b7369db220944cfe.jpg","title":"Duterte losing favor amid drug killings, wealth allegations","summary":"MANILA, Philippines (AP) — Filipinos' satisfaction with President Rodrigo Duterte has made its steepest drop since he took office last year amid an outcry over unabated drug killings and unresolved allegations that he has unexplained wealth, an independent poll showed.","published_at":1507516384,"content_id":"edf2da64-54ea-3cbe-ac36-63f42d141855","content_url":"https:\/\/www.yahoo.com\/news\/dutertes-rating-hit-steepest-drop-amid-drug-killings-154111564.html","content_published_at":1507516384,"content_relative_time":14,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-224ac3be-d224-307e-a28a-997310567f01_a-81432f54-e9de-38dc-b136-b717e42d0e19","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/police-home-invader-shot-multiple-62l3txn","author":"third_watch","provider":"Chicago Sun-Times","lead_attribution":"provider","link":"https:\/\/chicago.suntimes.com\/news\/police-home-invader-gets-shot-multiple-times-in-bronzeville\/","img":"https:\/\/s1.yimg.com\/uu\/api\/res\/1.2\/bENham8V8.z9sEGkKLeXSg--\/dz0xMDI0O2g9NjMwO3RhZz1vcmlnaW5hbDthcHBpZD15bmV3cw--\/http:\/\/streambe.zenfs.com\/streambe\/streambe_81432f54-e9de-38dc-b136-b717e42d0e19-2106119139.jpeg","title":"Police: Home invader shot multiple times in Bronzeville","summary":"A homeowner opened fire on a man who was trying to break into a residence late Saturday in the Bronzeville neighborhood on the South Side, police said. A 44-year-old man suffered multiple gunshot wounds to the body at 10:54 p.m. as he was trying to break into a home in the 4500 block of South St. Lawrence, according to Chicago Police. The homeowner told investigators that he opened fire after the man forced his way into the home with a crowbar, police said. The suspect then jumped into a vehicle, which fled to Mercy Hospital. The man was expected to be transferred in critical condition to Stroger Hospital. The homeowner, a 60-year-old man, has a valid FOID card and concealed carry permit, police","published_at":1507515718,"content_id":"81432f54-e9de-38dc-b136-b717e42d0e19","content_url":"https:\/\/chicago.suntimes.com\/news\/police-home-invader-gets-shot-multiple-times-in-bronzeville\/","content_published_at":1507438440,"content_relative_time":36,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-d76d5d6b-3c5a-3aa2-ad04-dabeacd72741_a-5a09b5cd-d2bd-3377-ad71-99467aa12be0","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/least-12-dead-scores-missing-rohingya-capsize-officials-3jiex39","author":"third_watch","provider":"AFP","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/news\/least-12-dead-scores-missing-rohingya-capsize-officials-024450462.html","img":"http:\/\/media.zenfs.com\/en_us\/News\/afp.com\/6ced06427272e32d6085320edfd3ff2c284c6f19.jpg","title":"At least 14 dead as Rohingya refugee boat sinks off Bangladesh","summary":"At least 14 Rohingya refugees, most of them children, drowned and scores more were missing Monday after their overloaded boat capsized in the latest tragedy to strike those fleeing violence in Myanmar. Authorities in Bangladesh said the boat was carrying between 60 and 100 people when it overturned and sank in rough seas on Sunday night. The bodies of 11 children, two women and a man were washed up on Shah Porir Dwip island in Bangladesh and border guards pulled 13 survivors from the sea, but the fate of the others remains unknown.","published_at":1507514188,"content_id":"5a09b5cd-d2bd-3377-ad71-99467aa12be0","content_url":"https:\/\/www.yahoo.com\/news\/least-12-dead-scores-missing-rohingya-capsize-officials-024450462.html","content_published_at":1507508786,"content_relative_time":16,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-6eeccbc6-c091-3930-96bc-7bc5aadcd761_a-1cbe2b44-0c39-3833-826b-17acd37fab27","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/man-found-missing-girl-gives-2l832p6","author":"ipostwhaticareabout","provider":"New York Post","lead_attribution":"provider","link":"http:\/\/nypost.com\/2017\/10\/08\/man-who-found-missing-girl-gives-his-7k-reward-to-her\/","img":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/_fc2hrrreAifbN7Z4iBBIw--\/dz0xMjAwO2g9ODAwO3RhZz1vcmlnaW5hbDthcHBpZD15bmV3cw--\/http:\/\/streambe.zenfs.com\/streambe\/streambe_1cbe2b44-0c39-3833-826b-17acd37fab27--1453843432.jpeg","title":"Man who found missing girl gives his $7K reward to her","summary":"A Minnesota farmer was presented with a $7,000 reward for finding a missing teenage girl — and then just moments later gave the money to the girl, who was a captive of three men for a month. Earl Melchert, 65, of Barrett, turned the reward money over to the girl Friday at police headquarters. “Today we witnessed an incredible example of kindness,” Alexandria Police Chief Rick Wyffels said on Facebook. The 15-year-old girl was abducted from her home on Aug. 8 in Alexandria, Minn., and taken to an abandoned house where she was physically and sexually assaulted. Fox News does not name alleged victims of sexual assault without their consent. Fox 9 Minneapolis reported that the girl escaped Sept.","published_at":1507514008,"content_id":"1cbe2b44-0c39-3833-826b-17acd37fab27","content_url":"http:\/\/nypost.com\/2017\/10\/08\/man-who-found-missing-girl-gives-his-7k-reward-to-her\/","content_published_at":1507507171,"content_relative_time":17,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-c25841d7-4754-39a0-ab53-5367433f593c_a-25ce60a7-cb48-3853-84f9-dde5d1a3bb7e","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/las-vegas-gunmans-nightstand-note-contained-figures-wind-004500302--abc-news-topstories-3gdjeh8","author":"third_watch","provider":"Good Morning America","lead_attribution":"provider","link":"https:\/\/www.yahoo.com\/gma\/las-vegas-gunmans-nightstand-note-contained-figures-wind-004500302--abc-news-topstories.html","img":"http:\/\/media.zenfs.com\/en_us\/gma\/us.abcnews.gma.com\/las-vegas-shooting-mandalay-bay-hotel-rt-jt-171008_16x9_992.jpg","title":"Las Vegas gunman's nightstand note contained figures for wind, trajectory and distance: Officials","summary":"A note containing handwritten numbers for wind, trajectory, and distance was discovered by Stephen Paddock's body inside the Las Vegas hotel room where he took his life last Sunday after slaughtering 58 people and injuring hundreds, officials have confirmed. Law enforcement officials briefed on the investigation confirmed to ABC News on Sunday that the note found on Paddock's hexagon-shaped nightstand contained such numerical figures. Pressed about what the meaning of the numbers were, Newton said, Paddock \"must have done the calculations online or something, to figure out what his altitude was going to be, and how high up he was -- how far out the crowd was going to be, and what -- at that distance -- and what the drop of his bullet was going to be.","published_at":1507502867,"content_id":"25ce60a7-cb48-3853-84f9-dde5d1a3bb7e","content_url":"https:\/\/www.yahoo.com\/gma\/las-vegas-gunmans-nightstand-note-contained-figures-wind-004500302--abc-news-topstories.html","content_published_at":1507509900,"content_relative_time":16,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1fc17dd4-591d-3b3d-abfd-d0b6dbd0578e_a-70991b4c-61be-3aef-81f1-5d45731f801b","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-1fc17dd4-591d-3b3d-abfd-d0b6dbd0578e_a-70991b4c-61be-3aef-81f1-5d45731f801b","author":"nanook","provider":"USA Today","lead_attribution":"provider","link":"https:\/\/www.usatoday.com\/story\/news\/nation-now\/2017\/10\/08\/las-vegas-shooting-retired-cop-told-friends-im-going-back-in-dont-come-after-me\/744850001\/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatoday-newstopstories","img":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/bpbod.31SfVsAoU01x0psw--\/dz0xNjAwO2g9ODAwO3RhZz1vcmlnaW5hbDthcHBpZD15bmV3cw--\/http:\/\/streambe.zenfs.com\/streambe\/streambe_70991b4c-61be-3aef-81f1-5d45731f801b--1648047475.jpeg","title":"Las Vegas shooting: Retired cop told friends, 'I'm going back in, don't come in after me'","summary":"Police: No motive determined in Vegas shooting First responders describe Vegas massacre chaos Coroner says all Vegas victims now identified Kellyanne Conway calls for 'thoughtful conversation' after Las Vegas Stephen Paddock's girlfriend hoped for 'quiet future' with him Celine Dion donates Vegas show proceeds to victims Report: Police searching for mystery woman seen with Las Vegas shooter Richie: 'We cannot sweep Vegas under the rug' Police release timeline of deadly Las Vegas shooting Lawyer: Girlfriend didn't know of attack plans Texas shop sold guns to Vegas shooter Survivor stories: Shooting victims share fight to live Trump: We are with Vegas '100%' #VegasStrong: Kindness abounds after","published_at":1507501044,"content_id":"70991b4c-61be-3aef-81f1-5d45731f801b","content_url":"https:\/\/www.usatoday.com\/story\/news\/nation-now\/2017\/10\/08\/las-vegas-shooting-retired-cop-told-friends-im-going-back-in-dont-come-after-me\/744850001\/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatoday-newstopstories","content_published_at":1507504212,"content_relative_time":17,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-783b98a9-d88a-3322-b538-98e96f4fed45_a-231b9464-1766-31db-834c-1dd001c0664c","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/diwali-festival-lights-yorks-times-37lzyq6","author":"nanook","provider":"HuffPost","lead_attribution":"provider","link":"http:\/\/www.huffingtonpost.com\/entry\/diwali-festival-new-york-times-square_us_59d518fde4b04b9f9207066a","img":"https:\/\/s1.yimg.com\/uu\/api\/res\/1.2\/BwvypveZe3_YAZnuWxGbyw--\/dz0xOTEwO2g9MTAwMDt0YWc9b3JpZ2luYWw7YXBwaWQ9eW5ld3M-\/http:\/\/streambe.zenfs.com\/streambe\/streambe_231b9464-1766-31db-834c-1dd001c0664c--1738371536.jpeg","title":"Diwali Festival Lights Up New York's Times Square","summary":"NEW YORK ― New York City's iconic Times Square transformed into a vision of South Asian culture on Saturday, as thousands of revelers gathered for an early celebration of Diwali, the Hindu festival of lights. Diwali, also known as Deepavali, is the biggest and most important holiday in India. It lasts for five days, and coincides with the Hindu new year. Hindus, Jains, Buddhists and Sikhs celebrate the religious occasion every autumn in countries throughout South Asia and beyond. In the United States, major Diwali festivals have lit up communities from California to Texas to North Carolina in recent years. The massive Times Square event ― the largest Diwali celebration outside of India ― has","published_at":1507489640,"content_id":"231b9464-1766-31db-834c-1dd001c0664c","content_url":"http:\/\/www.huffingtonpost.com\/entry\/diwali-festival-new-york-times-square_us_59d518fde4b04b9f9207066a","content_published_at":1507424365,"content_relative_time":40,"vibe_name":"Society & Culture"},{"post_id":"v-5f31157d-3f7d-30fd-af79-9f13bf1f304c_c-7707153d-10b1-3b53-9cc1-05b718484154_a-46087e14-ad5e-3e12-9d8d-a673b2217412","post_url":"https:\/\/www.yahoo.com\/newsroom\/vibes\/society-culture\/search-continues-driver-car-believed-4thi5hc","author":"rocky.j.mountain","provider":"latimes.com","lead_attribution":"provider","link":"http:\/\/www.latimes.com\/local\/lanow\/la-me-ln-racing-fatal-20171008-htmlstory.html","img":"https:\/\/s.yimg.com\/uu\/api\/res\/1.2\/jNwvBI1WyVtRFiCmyWJ9Gw--\/dz0yMDAwO2g9MTEyNDt0YWc9b3JpZ2luYWw7YXBwaWQ9eW5ld3M-\/http:\/\/streambe.zenfs.com\/streambe\/streambe_46087e14-ad5e-3e12-9d8d-a673b2217412-303233867.jpeg","title":"Search continues for driver of car believed to be racing with vehicle that crashed, killing its four occupants","summary":"Authorities are continuing their search for the driver of a car they believe was racing with another vehicle that crashed into a tree in Northridge, killing all four occupants. The crash occurred about 11 p.m. Friday, when the driver of a silver BMW lost control of the car while speeding east on Lassen Street alongside a dark-colored sedan, said Officer Shane Bales of the Los Angeles Police Department. The BMW crossed into oncoming traffic lanes near Balboa Boulevard and hit a light pole before slamming into a tree. Flames engulfed the car, and the impact was so severe that it ejected the car's engine, Bales said. The car broke into several pieces. Authorities believe the cars were traveling","published_at":1507484146,"content_id":"46087e14-ad5e-3e12-9d8d-a673b2217412","content_url":"http:\/\/www.latimes.com\/local\/lanow\/la-me-ln-racing-fatal-20171008-htmlstory.html","content_published_at":1507498256,"content_relative_time":19,"vibe_name":"Society & Culture"}]